In [1]:
import pandas as pd
import numpy as np

In [100]:
pip install pandas

Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (1.3.0)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.17.3 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.20.3)
Requirement already satisfied: pytz>=2017.3 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
lst =  [list(range(1, 5)) for i in range(5)]
lst

[[1, 2, 3, 4], [1, 2, 3, 4], [1, 2, 3, 4], [1, 2, 3, 4], [1, 2, 3, 4]]

In [4]:
df = pd.DataFrame(lst, index = ["Harry", "Hermione", "Ron", "Malfoy", "Snake"], columns = ["Col_1", "Col_2", "Col_3", "Col_4"])

In [30]:
df.shape

(5, 4)

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Harry to Snake
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col_1   5 non-null      int64
 1   Col_2   5 non-null      int64
 2   Col_3   5 non-null      int64
 3   Col_4   5 non-null      int64
dtypes: int64(4)
memory usage: 200.0+ bytes

In [49]:
df

          Col_1  Col_2  Col_3  Col_4
Harry         1      2      3      4
Hermione      1      2      3      4
Ron           1      2      3      4
Malfoy        1      2      3      4
Snake         1      2      3      4

In [41]:
df["Col_1"]

Harry       1
Hermione    1
Ron         1
Malfoy      1
Snake       1
Name: Col_1, dtype: int64

In [42]:
df.Col_1

Harry       1
Hermione    1
Ron         1
Malfoy      1
Snake       1
Name: Col_1, dtype: int64

In [50]:
df.iloc[:3, :3]

          Col_1  Col_2  Col_3
Harry         1      2      3
Hermione      1      2      3
Ron           1      2      3

In [51]:
df.loc["Snake", "Col_3"]

3

In [52]:
df.values

array([[1, 2, 3, 4],
       [1, 2, 3, 4],
       [1, 2, 3, 4],
       [1, 2, 3, 4],
       [1, 2, 3, 4]], dtype=int64)

In [56]:
df[["Col_1", "Col_3"]]

          Col_1  Col_3
Harry         1      3
Hermione      1      3
Ron           1      3
Malfoy        1      3
Snake         1      3

In [57]:
df

          Col_1  Col_2  Col_3  Col_4
Harry         1      2      3      4
Hermione      1      2      3      4
Ron           1      2      3      4
Malfoy        1      2      3      4
Snake         1      2      3      4

In [58]:
df.Col_1.value_counts()

1    5
Name: Col_1, dtype: int64

In [72]:
df = df.astype({"Col_2": "int32"})

In [73]:
df.Col_2.dtype

dtype('int32')

In [87]:
df.rename(columns = {"Col_3": "Not_Col"}, inplace = True)

In [88]:
df

          Col_1  Col_2  Not_Col  Col_4
Harry         1      2        3      4
Hermione      1      2        3      4
Ron           1      2        3      4
Malfoy        1      2        3      4
Snake         1      2        3      4

In [89]:
df.columns = range(1, 5)

In [91]:
df

          1  2  3  4
Harry     1  2  3  4
Hermione  1  2  3  4
Ron       1  2  3  4
Malfoy    1  2  3  4
Snake     1  2  3  4

In [7]:
df.to_csv("my_data.csv", )

In [5]:
df

          Col_1  Col_2  Col_3  Col_4
Harry         1      2      3      4
Hermione      1      2      3      4
Ron           1      2      3      4
Malfoy        1      2      3      4
Snake         1      2      3      4

In [6]:
type(df)

pandas.core.frame.DataFrame

In [2]:
pd.__version__

'1.3.0'

In [31]:
df1 = pd.read_csv("my_data.csv")
df1

  Unnamed: 0  Col_1  Col_2  Col_3  Col_4
0      Harry      1      2      3      4
1   Hermione      1      2      3      4
2        Ron      1      2      3      4
3     Malfoy      1      2      3      4
4      Snake      1      2      3      4

In [17]:
df1.iloc[: , :]

  Unnamed: 0  Col_1  Col_2  Col_3  Col_4
0      Harry      1      2      3      4
1   Hermione      1      2      3      4
2        Ron      1      2      3      4
3     Malfoy      1      2      3      4
4      Snake      1      2      3      4

In [24]:
df1[df1.columns]

  Unnamed: 0  Col_1  Col_2  Col_3  Col_4
0      Harry      1      2      3      4
1   Hermione      1      2      3      4
2        Ron      1      2      3      4
3     Malfoy      1      2      3      4
4      Snake      1      2      3      4

In [23]:
df1.columns

Index(['Unnamed: 0', 'Col_1', 'Col_2', 'Col_3', 'Col_4'], dtype='object')

In [26]:
idx = df1.iloc[:,0]
df1 = df1.iloc[:,1:]
df1

   Col_1  Col_2  Col_3  Col_4
0      1      2      3      4
1      1      2      3      4
2      1      2      3      4
3      1      2      3      4
4      1      2      3      4

In [30]:
df1.index = list(idx)
df1

          Col_1  Col_2  Col_3  Col_4
Harry         1      2      3      4
Hermione      1      2      3      4
Ron           1      2      3      4
Malfoy        1      2      3      4
Snake         1      2      3      4

In [33]:
df1.set_index("Col_4")

      Unnamed: 0  Col_1  Col_2  Col_3
Col_4
4          Harry      1      2      3
4       Hermione      1      2      3
4            Ron      1      2      3
4         Malfoy      1      2      3
4          Snake      1      2      3